export const hi = {
  // home
  welcome: "फार्मिको में आपका स्वागत है",
  loading: "लोड हो रहा है ...",

  // navbar
  farmico: "फार्मिको",
  login: "लॉग इन",
  blogs: "ब्लॉग",
  aiTools: "कृत्रिम बुद्धिमत्ता उपकरण",

  // login
  email: "ईमेल",
  password: "पासवर्ड",
  dont_have_an_account: "खाता नहीं है?",
  create_an_account: "खाता बनाएं",

  // register
  // register: "रजिस्टर करें",
  register: "रजिस्टर",
  name: "नाम",
  john_doe: "जॉन डो",
  username: "उपयोगकर्ता नाम",
  johnbhai: "जॉनभाई",
  username_small_than_4_char: "उपयोगकर्ता नाम 4 वर्णों से छोटा नहीं हो सकता",
  username_not_available: "उपयोगकर्ता नाम उपलब्ध नहीं है😢। अलग कोशिश करें.",
  confirm_password: "पासवर्ड की पुष्टि कीजिये",
  already_have_an_account: "पहले से ही एक खाता है?",
  log_in: "लॉग इन",

  // auth
  unautheticated_request: "अनधिकृत अनुरोध!",
  please_login_again: "कृपया फिर लॉग इन करें। सत्र समाप्त हुआ",

  // search
  search_blogs_with_atleast_3_char: "कम से कम 3 वर्णों से ब्लॉग खोजें",

  // blogs
  mins_read: "मिनट पढ़ें",
  no_blogs_written_yet: "अभी तक कोई ब्लॉग नहीं लिखा है। पहले बनें 😎",
  blogs_couldnt_be_fetched: "ब्लॉग नहीं लाए जा सके 😢",

  // blog
  add_comment: "टिप्पणी जोड़ना",
  comments: "टिप्पणियाँ",

  // Comment modal
  comment_somehing_meaningful: "कुछ सार्थक टिप्पणी करें...",
  cancel: "रद्द करना",
  // delete: "हटाना",
  delete: "विलोपन",

  // delete modal
  are_you_sure: "क्या आपको यकीन है?",
  this_action_cant_be_reversed: "इस क्रिया को उलटा नहीं किया जा सकता.",

  // profile
  profile: "प्रोफ़ाइल",
  my_info: "मेरी जानकारी",
  reports: "रिपोर्ट",
  update_info: "जानकारी अद्यतन",
  admin: "व्यवस्थापक",
  logout: "लॉग आउट",

  // reports
  all_reports: "सभी रिपोर्ट",
  no_reports_yet: "अभी तक कोई रिपोर्ट नहीं!",
  plant_disease_detection: "पौधे की बीमारी का पता लगाना",
  weed_detection: "खरपतवार का पता लगाना",

  // results
  suggested_read: "पढ़ने का सुझाव दिया",
  unhealthy: "बीमार",
  healthy: "निरोग",
  weed: "कूड़े की घास",
  detected: "पता चला",
  not_detected: "पता नहीं चला",
  result: "नतीजा",

  // blog
  all_blogs: "सभी ब्लॉग",
  no_blogs_yet: "अभी तक कोई ब्लॉग नहीं!",

  // create/update blog
  update: "अपडेट करें",
  publish: "प्रकाशित करना",
  enter_title: "यहां अपना शीर्षक दर्ज करें ...",
  subtitle: "उपशीर्षक",
  write_something_useful: "कुछ उपयोगी लिखें ....",

  // models
  plant_disease_detection_model: "पौधे की बीमारी का पता लगाना",
  weed_detection_model: "खरपतवार का पता लगाना",
  predict: "पूर्वानुमेय देना",
  drop_image_to_predict: "पूर्वानुमेय करने के लिए छवि छोड़ें",

  // messages
  // success
  success: "सफल",
  welcome_to_the_farmico: "फार्मिको में आपका स्वागत है",
  welcome_back_to_the_farmico: "फार्मिको में आपका फिर से स्वागत है",

  // errors
  error: "त्रुटि",
  login_error: "लॉगिन त्रुटि",
  register_error: "रजिस्टर त्रुटि",

  invalid_request: "अमान्य अनुरोध",
  image_is_request: "छवि की आवश्यकता है.",
  model_prediction_error: "मॉडल पूर्वानुमेयता त्रुटि",

  // create/edit blog
  body_length_atleast_250: "ब्लॉग की लंबाई कम से कम 250 वर्ण लंबी होनी चाहिए",
  blog_published_successfully: "ब्लॉग सफलतापूर्वक प्रकाशित हुआ",
  blog_edited_successfully: "ब्लॉग सफलतापूर्वक संपादित किया गया",
  blog_deleted_successfully: "ब्लॉग सफलतापूर्वक हटा दिया गया",

  // comments and likes
  invalid_comment: "अमान्य टिप्पणी",
  comment_cant_be_empty: "टिप्पणी खाली नहीं हो सकती",
  error_in_commenting: "टिप्पणी करने में त्रुटि",
  error_in_deleting_a_comment: "टिप्पणी हटाने में त्रुटि",

  error_in_voting: "मतदान में त्रुटि",

  // profile
  profile_updated_successfully: "प्रोफाइल को सफलतापूर्वक अपडेट किया गया",
  image_size_cant_exceed_1_5_mb: "छवि का आकार 1.5MB से अधिक नहीं हो सकता",

  // models/result
  model_result_deleted_successfully: "मॉडल परिणाम सफलतापूर्वक हटाया गया",
  delete_failed: "मिटाना विफल हो गया",
  error_in_fetching: "लाने में त्रुटि",
  only_one_file_is_allowed: "केवल एक फ़ाइल की अनुमति है",
  image_size_cant_exceed_1_mb: "छवि का आकार 1MB से अधिक नहीं होना चाहिए",
};
