export const mr = {
  // home
  welcome: "फार्मिको मध्ये आपले स्वागत आहे",
  loading: "लोड होत आहे ...",

  // navbar
  farmico: "फार्मिको",
  login: "लॉगिन",
  blogs: "ब्लॉग",
  aiTools: "कृत्रिम बुद्धिमत्ता साधने",

  // login
  email: "ईमेल",
  password: "पासवर्ड",
  dont_have_an_account: "खाते नाही?",
  create_an_account: "खाते तयार करा",

  // register
  // register: "नोंदणी करा",
  register: "नोंदणी",
  name: "नाव",
  john_doe: "जॉन डो",
  username: "वापरकर्तानाव",
  johnbhai: "जॉनभाई",
  username_small_than_4_char: "वापरकर्तानाव 4 वर्णांपेक्षा लहान असू शकत नाही",
  username_not_available: "वापरकर्तानाव उपलब्ध नाही 😢. वेगळा प्रयत्न करा.",
  confirm_password: "पासवर्डची पुष्टी करा",
  already_have_an_account: "आधीपासूनच एक खाते आहे?",
  log_in: "लॉग इन",

  // auth
  unautheticated_request: "अप्रमाणित विनंती!",
  please_login_again: "कृपया पुन्हा लॉगिन करा. सत्र कालबाह्य झाले",

  // search
  search_blogs_with_atleast_3_char: "किमान 3 वर्णांसह ब्लॉग शोधा",

  // blogs
  mins_read: "मिनिटे वाचा",
  no_blogs_written_yet: "अजून ब्लॉग लिहिलेले नाहीत. प्रथम व्हा 😎",
  blogs_couldnt_be_fetched: "ब्लॉग मिळवता आले नाहीत 😢",

  // blog
  add_comment: "टिप्पणी करा",
  comments: "टिप्पण्या",

  // Comment modal
  comment_somehing_meaningful: "काहीतरी अर्थपूर्ण टिप्पणी करा...",
  cancel: "रद्द करा",
  delete: "हटवा",

  // delete modal
  are_you_sure: "तुम्हाला खात्री आहे?",
  this_action_cant_be_reversed: "ही क्रिया उलट केली जाऊ शकत नाही.",

  // profile
  profile: "प्रोफाइल",
  my_info: "माझी माहिती",
  reports: "अहवाल",
  update_info: "माहिती अद्यतनित करा",
  admin: "प्रशासक",
  logout: "बाहेर पडा",

  // reports
  all_reports: "सर्व अहवाल",
  no_reports_yet: "अद्याप कोणतेही अहवाल नाहीत!",
  plant_disease_detection: "वनस्पती रोग शोधणे",
  weed_detection: "तण शोधणे",

  // results
  suggested_read: "वाचण्याची सूचना केली",
  unhealthy: "रोगी",
  healthy: "निरोगी",
  weed: "तण",
  detected: "आढळले",
  not_detected: "आढळले नाही",
  result: "परिणाम",

  // blog
  all_blogs: "सर्व ब्लॉग",
  no_blogs_yet: "अद्याप कोणतेही ब्लॉग नाहीत!",

  // create/update blog
  update: "अद्यायावत करणे",
  publish: "प्रकाशित करा",
  enter_title: "आपले शीर्षक येथे प्रविष्ट करा ...",
  subtitle: "उपशीर्षक",
  write_something_useful: "काहीतरी उपयुक्त लिहा ....",

  // models
  plant_disease_detection_model: "वनस्पती रोग शोधणे",
  weed_detection_model: "तण शोधणे",
  predict: "अंदाज",
  drop_image_to_predict: "अंदाज लावण्यासाठी प्रतिमा अपलोड करा",

  // messages
  // success
  success: "सफल",
  welcome_to_the_farmico: "फार्मिको मध्ये आपले स्वागत आहे",
  welcome_back_to_the_farmico: "फार्मिको मध्ये परत स्वागत आहे",

  // errors
  error: "त्रुटी",
  login_error: "लॉग इन त्रुटी",
  register_error: "नोंदणी त्रुटी",

  invalid_request: "अवैध विनंती",
  image_is_request: "प्रतिमा आवश्यक आहे.",
  model_prediction_error: "मॉडेल अंदाज त्रुटी",

  // create/edit blog
  body_length_atleast_250: "ब्लॉगची लांबी किमान 250 वर्ण लांब असणे आवश्यक आहे",
  blog_published_successfully: "ब्लॉग यशस्वीरित्या प्रकाशित झाला",
  blog_edited_successfully: "ब्लॉग यशस्वीरित्या संपादित केला",
  blog_deleted_successfully: "ब्लॉग यशस्वीरित्या हटवला",

  // comments and likes
  invalid_comment: "अवैध टिप्पणी",
  comment_cant_be_empty: "टिप्पणी रिक्त असू शकत नाही",
  error_in_commenting: "टिप्पणी करताना त्रुटी",
  error_in_deleting_a_comment: "टिप्पणी हटवताना त्रुटी",

  error_in_voting: "मतदानात त्रुटी",

  // profile
  profile_updated_successfully: "प्रोफाइल यशस्वीरित्या अद्यायावत केले",
  image_size_cant_exceed_1_5_mb:
    "प्रतिमेचा आकार 1.5MB पेक्षा जास्त असू शकत नाही",

  // models/result
  model_result_deleted_successfully: "मॉडेल परिणाम यशस्वीरित्या हटवला",
  delete_failed: "हटवणे अयशस्वी झाले",
  error_in_fetching: "आणण्‍यात त्रुटी",
  only_one_file_is_allowed: "फक्त एक फाइल परवानगी आहे",
  image_size_cant_exceed_1_mb: "प्रतिमेचा आकार 1MB पेक्षा जास्त नसावा",
};
